# Reload Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkType..::..Reload Method
CADLinkType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Reload()()()() | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |
| Reload(CADLinkOptions) | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |

# See Also
CADLinkType Class
CADLinkType Members
Autodesk.Revit.DB Namespace